app/views/profiles/index.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
---
      <td>
          <% p= Profile.where("user_id IN(?)",c.subscription_id)%>