app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "bio", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "radhesham nagare"], ["bio", "i'm a student"], ["user_id", 1], ["created_at", "2022-03-23 12:38:51.908991"], ["updated_at", "2022-03-23 12:38:51.908991"]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "bio" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["bio", "I'm a student of Computer Science."], ["updated_at", "2022-04-02 06:47:04.431418"], ["id", 5]]