app/views/layouts/_navbar.html.erb

          <%= image_tag current_user.profile.profile_photo ,class:"rounded-circle",style:"width:50px;height:50px;" %>
          <%= link_to "Hi,"+current_user.profile.name.split.map(&:capitalize).join(' ') , profiles_path(current_user.profile) %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]